# Import Libraries

In [3]:
import pandas as pd
import numpy as np
import os

# Import Data

In [4]:
file_path = r"D:\career Foundary\Data_immersion\4_python_projects\Instacart Basket Analysis"

In [5]:
# Import products.csv
df_products = pd.read_csv(os.path.join(file_path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

In [6]:
# Import orders.csv

In [7]:
df_orders = pd.read_csv(os.path.join(file_path,'02 Data', 'Original Data', 'orders.csv'), index_col = False)

In [8]:
df_orders.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [9]:
df_orders_no_eval_set = df_orders.drop(columns = ["eval_set"])

In [10]:
df_orders_no_eval_set

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0
...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.0
3421079,1854736,206209,11,4,10,30.0
3421080,626363,206209,12,1,12,18.0
3421081,2977660,206209,13,1,12,7.0
3421082,272231,206209,14,6,14,30.0

In [11]:
df_orders_no_eval_set.rename(columns = {'order_dow' : 'orders_day_of_week'}, inplace = True)

In [12]:
df_orders_no_eval_set

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0
...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.0
3421079,1854736,206209,11,4,10,30.0
3421080,626363,206209,12,1,12,18.0
3421081,2977660,206209,13,1,12,7.0
3421082,272231,206209,14,6,14,30.0

# Consistency Checks Example

In [13]:
# Create an empty dataframe

In [14]:
df_test = pd.DataFrame()

In [15]:
# Create a mixed data type dataframe of column

In [16]:
df_test ["mix"] = ["a", "b", 1, True]

In [17]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [18]:
# Check for mixed types. 
# The function for checking whether a dataframe contains any mixed-type columns is as follows:

In [19]:
for col in df_test.columns.tolist():
    weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_test[weird]) > 0:
        print (col)

mix

In [20]:
# To convert your data to a specific data types as needed
df_test["mix"] = df_test["mix"].astype("str")

# Missing Values

In [21]:
# Finding Missing Values. What this does is assign the function to the dataframe, then sum the result.

In [22]:
df_products.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [23]:
#To actually view these 16 values miising, you can create a subset of the dataframe containing only this values

In [24]:
df_Missing = df_products[df_products["product_name"].isnull() == True]

In [25]:
df_Missing

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

# Addressing Missing Values

In [26]:
#There are a few ways to deal with missing data:

# 1) Create a new variable that acts like a flag based on the missing value.
# 2)Impute the value with the mean or median of the column (if the variable is numeric).
# 3)Remove or filter out the missing data. If you choose to use the mean, you can use the # df.describe()
# then use the following code to replace your missing values with it:

             df['column with missings'].fillna(mean value, inplace=True)

                               df_prods.median()

Looking at the rows in df_nan, it quickly becomes clear that there isn’t much you can do in terms of imputation. The missing values here are product names, which are strings. String values can’t be imputed like numeric values, leaving you in a bit of a pickle. You can either remove the missing values entirely or filter out the ones that aren’t missing into a subset dataframe and continue your analysis with this new dataframe

In [27]:
df_products.shape

(49693, 5)

In [28]:
# Method 1
df_without_missing_data = df_products[df_products["product_name"].isnull() == False]

In [29]:
df_without_missing_data

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3
...,...,...,...,...,...
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3
49689,49685,En Croute Roast Hazelnut Cranberry,42,1,3.1
49690,49686,Artisan Baguette,112,3,7.8
49691,49687,Smartblend Healthy Metabolism Dry Cat Food,41,8,4.7
49692,49688,Fresh Foaming Cleanser,73,11,13.5

In [30]:
# The result shows a difference in the number of rows

In [31]:
# Another way you can drop all missing values is via the following command

In [32]:
# Method 2
df_products.dropna(subset = ['product_name'], inplace = True)

# Duplicates

In [33]:
# Finding Duplicates

In [34]:
df_duplicates = df_without_missing_data[df_without_missing_data.duplicated()]

In [35]:
df_duplicates

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [36]:
# Addressing Duplicates

In [37]:
df_without_missing_data.shape

(49677, 5)

In [38]:
# create a new dataframe that doesn’t include the duplicates

In [39]:
df_without_duplicates = df_without_missing_data.drop_duplicates()

In [40]:
df_without_duplicates

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3
...,...,...,...,...,...
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3
49689,49685,En Croute Roast Hazelnut Cranberry,42,1,3.1
49690,49686,Artisan Baguette,112,3,7.8
49691,49687,Smartblend Healthy Metabolism Dry Cat Food,41,8,4.7
49692,49688,Fresh Foaming Cleanser,73,11,13.5

In [41]:
df_without_duplicates.shape

(49672, 5)

# EX 4.5

In [42]:
# Data Consistency Checks df_orders dataframe

In [43]:
df_orders_no_eval_set.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

Using these results, you can begin investigating the accuracy of the columns in your dataframe. You know that the "order_dow" column, for instance, can’t have a maximum larger than 7. This would be impossible as there are only 7 days in a week. A frequency check on this column should result in a minimum of 0 and a maximum of 6, for a total of exactly 7 values. You can also double-check the 50th percentile. In this case, you know it should be 3, as 3 is at the exact center of 0 and 6 (0, 1, 2, 3, 4, 5, 6). From these checks, you can be sure that your "order_dow" column doesn’t have any strange or incorrect values in it.

Let’s see what other checks you can conduct together with this function. You wouldn’t, for instance, expect to see a negative minimum value for "days_since_prior_order", as this would imply a negative number of days. Nor would you expect a maximum larger than 24 for "order_hour_of_day" as there are only 24 hours in a day.

In [44]:
# Check for mixed-type data in your df_ords dataframe.

In [45]:
for col in df_orders_no_eval_set.columns.tolist():
    Different_data_types = (df_orders_no_eval_set[[col]].applymap(type) != df_orders_no_eval_set[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_orders_no_eval_set[ Different_data_types]) > 0:
        print (col, ' mixed')
    else: print(col, ' consistent')

order_id  consistent
user_id  consistent
order_number  consistent
orders_day_of_week  consistent
order_hour_of_day  consistent
days_since_prior_order  consistent

In [46]:
#5. Run a check for missing values in your df_ords dataframe.

In [47]:
df_orders_no_eval_set.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [48]:
# days_since_prior_order has 206209 missing values

In [49]:
# create a dataframe for the missing values
df_orders_missing_values = df_orders_no_eval_set [df_orders_no_eval_set ['days_since_prior_order'].isnull () == True]

In [50]:
df_orders_missing_values

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
11,2168274,2,1,2,11,NaN
26,1374495,3,1,1,14,NaN
39,3343014,4,1,6,11,NaN
45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...
3420930,969311,206205,1,4,12,NaN
3420934,3189322,206206,1,3,18,NaN
3421002,2166133,206207,1,6,19,NaN
3421019,2227043,206208,1,1,15,NaN
3421069,3154581,206209,1,3,11,NaN

In [51]:
# The NAN tell that there is no data available for the user’s last order date. This could be that the customers are either first timers shoping or never place others before.
# The best to deal with this is create another separate column to differenitate this.

In [52]:
# Address the missing values using an appropriate method.

In [53]:
df_orders_no_eval_set.shape

(3421083, 6)

In [54]:
# df_orders_missing_values[df_orders_missing_values['days_since_prior_order'].isnull() == False]

In [55]:
df_orders_missing_values.shape

(206209, 6)

In [56]:
# Run a check for duplicate values in your df_ords data.

In [57]:
df_orders_clean_data = df_orders_no_eval_set[df_orders_no_eval_set.duplicated()]

In [58]:
df_orders_clean_data.size

0

In [59]:
df_orders_no_eval_set.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [60]:
# There were no duplicates in the dataset

In [61]:
# export your final, cleaned df_prods and df_ords data as “.csv” files in your “Prepared Data”

In [62]:
df_orders_no_eval_set.to_csv(os.path.join(file_path, '02 Data','Prepared Data', 'orders_clean.csv'))

In [63]:
df_without_duplicates.to_csv(os.path.join(file_path, '02 Data','Prepared Data', 'products_clean.csv'))